app/controllers/api/v1/posts_controller.rb

  def index
    @posts = Post.includes(:user).all
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 2], ["id", 1]]

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "socorro"], ["created_at", "2023-11-22 21:28:23.198087"], ["updated_at", "2023-11-22 21:28:23.198087"], ["user_id", 2]]